DataProcessors/КонтрольИнкассаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КонтрольИнкассаций</Name>
			<Comment>//+++АК LAGP 2018.09.25 ИП-00019420 Разработал Лагерев.</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЛистовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресаДляРассылкиБухРасчётчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресаДляРассылкиПомощникТУЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРасчётчикаВЛистеУчёта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратыДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инкассатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инкассация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛистУчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛистУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличныеПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЯвочнойКартыДляИнкассации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окраска</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйЗаОтмену</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправленоПисьмоОтмены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПисьмоОтменыБылоОтправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПисьмоРасхожденияБылоОтправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаПоДеньгам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешенныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Самоинкассация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникБухРасчётчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтрольИнкассаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтрольИнкассаций</Name>
			<Comment>//+++АК LAGP 2018.09.24 ИП-00019420</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтправленоПисьмоОРасхождении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленоПисьмоОтмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОтмену</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛистУчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛистУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикИнкассации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГрафикИнкассации</Name>
			<Comment>//+++АК LAGP 2018.09.24 ИП-00019420</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИнкассацияПн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнкассацияВт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнкассацияСр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнкассацияЧт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнкассацияПт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнкассацияСб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнкассацияВс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиДляРассылки</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/КонтрольИнкассаций/Ext/ManagerModule.bsl
//+++АК LAGP 2018.11.20 ИП-00020402 Рассылка по лимитам инкассаций
Процедура СформироватьИОтправитьПисьмаПревышенияЛимита(НачПериода = Неопределено) Экспорт
	
	СтруктураПисьма = Новый Структура;
	Кому = Новый СписокЗначений;
	Кому.Добавить("lagp@automacon.ru");
	СтруктураПисьма.Вставить("Кому", Кому);
				
	СтруктураПисьма.Вставить("Тема", "Обработка КонтрольИнкассаций (перед запросом) - " + ТекущаяДата());
	СтруктураПисьма.Вставить("Тело", "123");
	СтруктураПисьма.Вставить("СписокФайловВложений", Новый Массив);
				
	ОбщегоНазначенияКлиентСервер.ОтправитьПисьмоПоПочте(СтруктураПисьма);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛистУчетаДокумент.Ссылка КАК ЛистУчета,
	|	ЛистУчетаДокумент.ТорговаяТочка,
	|	ЛистУчетаДокумент.НачальныйОстаток,
	|	ЛистУчетаДокумент.СуммаНал КАК НаличныеПоступления,
	|	ЛистУчетаДокумент.ВозвратПокупателю КАК ВозвратыДС,
	|	ЛистУчетаДокумент.Отклонение КАК РазницаПоДеньгам,
	|	ЛистУчетаДокумент.СуммаИнкассации КАК Инкассация,
	|	ЛистУчетаДокумент.КонечныйОстаток,
	|	ЕСТЬNULL(КонтрольИнкассаций.ОтправленоПисьмоОРасхождении, ЛОЖЬ) КАК ПисьмоРасхожденияБылоОтправлено,
	|	КонтрольИнкассаций.ОтправленоПисьмоОтмены,
	|	КонтрольИнкассаций.ОтправленоПисьмоОтмены КАК ПисьмоОтменыБылоОтправлено,
	|	КонтрольИнкассаций.ОтветственныйЗаОтмену,
	|	КонтрольИнкассаций.ПричинаОтмены,
	|	ВЫБОР
	|		КОГДА ДЕНЬНЕДЕЛИ(ЛистУчетаДокумент.Дата) = 1
	|			ТОГДА ГрафикИнкассации.ИнкассацияПн
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДЕНЬНЕДЕЛИ(ЛистУчетаДокумент.Дата) = 2
	|					ТОГДА ГрафикИнкассации.ИнкассацияВт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДЕНЬНЕДЕЛИ(ЛистУчетаДокумент.Дата) = 3
	|							ТОГДА ГрафикИнкассации.ИнкассацияСр
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ДЕНЬНЕДЕЛИ(ЛистУчетаДокумент.Дата) = 4
	|									ТОГДА ГрафикИнкассации.ИнкассацияЧт
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ДЕНЬНЕДЕЛИ(ЛистУчетаДокумент.Дата) = 5
	|											ТОГДА ГрафикИнкассации.ИнкассацияПт
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ДЕНЬНЕДЕЛИ(ЛистУчетаДокумент.Дата) = 6
	|													ТОГДА ГрафикИнкассации.ИнкассацияСб
	|												ИНАЧЕ ВЫБОР
	|														КОГДА ДЕНЬНЕДЕЛИ(ЛистУчетаДокумент.Дата) = 7
	|															ТОГДА ГрафикИнкассации.ИнкассацияВс
	|													КОНЕЦ
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЭтоДеньИнкассации,
	|	СтруктурныеЕдиницы.КонтрагентИнкассатор КАК Инкассатор,
	|	ЛистУчетаДокумент.Дата,
	|	СтруктурныеЕдиницы.НомерТочки,
	|	СтруктурныеЕдиницы.НомерЯвочнойКартыДляИнкассации,
	|	СтруктурныеЕдиницы.Самоинкассация,
	|	Пользователи.ФизЛицо КАК РасчётчикФизЛицо
	|ПОМЕСТИТЬ втПодготовленная
	|ИЗ
	|	Документ.ЛистУчета КАК ЛистУчетаДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрольИнкассаций КАК КонтрольИнкассаций
	|		ПО (КонтрольИнкассаций.ЛистУчета = ЛистУчетаДокумент.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикИнкассации КАК ГрафикИнкассации
	|		ПО ЛистУчетаДокумент.ТорговаяТочка = ГрафикИнкассации.ТорговаяТочка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ЛистУчетаДокумент.ТорговаяТочка = СтруктурныеЕдиницы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ЛистУчетаДокумент.Расчетчик = Пользователи.Ссылка
	|ГДЕ
	|	ЛистУчетаДокумент.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЛистУчетаДокумент.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПодготовленная.ЛистУчета,
	|	втПодготовленная.ТорговаяТочка КАК ТорговаяТочка,
	|	втПодготовленная.НачальныйОстаток,
	|	втПодготовленная.НаличныеПоступления,
	|	втПодготовленная.ВозвратыДС,
	|	втПодготовленная.РазницаПоДеньгам,
	|	втПодготовленная.Инкассация,
	|	втПодготовленная.КонечныйОстаток,
	|	втПодготовленная.ПисьмоРасхожденияБылоОтправлено,
	|	втПодготовленная.ОтправленоПисьмоОтмены,
	|	втПодготовленная.ПисьмоОтменыБылоОтправлено,
	|	втПодготовленная.ОтветственныйЗаОтмену,
	|	втПодготовленная.ПричинаОтмены,
	|	втПодготовленная.ЭтоДеньИнкассации,
	|	ВЫБОР
	|		КОГДА втПодготовленная.КонечныйОстаток >= 100000
	|				И втПодготовленная.Самоинкассация = ИСТИНА
	|			ТОГДА ""Превышен лимит инкассации!""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА втПодготовленная.КонечныйОстаток >= 250000
	|						И втПодготовленная.Самоинкассация = ЛОЖЬ
	|					ТОГДА ""Превышен лимит инкассации!""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК Контроль,
	|	втПодготовленная.Инкассатор КАК Инкассатор,
	|	втПодготовленная.Дата КАК Период,
	|	втПодготовленная.НомерЯвочнойКартыДляИнкассации,
	|	втПодготовленная.Самоинкассация,
	|	ЛОЖЬ КАК Окраска,
	|	КонтактнаяИнформация.Представление КАК АдресРасчётчикаВЛистеУчёта
	|ПОМЕСТИТЬ втФинал
	|ИЗ
	|	втПодготовленная КАК втПодготовленная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО втПодготовленная.РасчётчикФизЛицо = КонтактнаяИнформация.Объект
	|ГДЕ
	|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailФизЛица)
	|	И втПодготовленная.ПисьмоРасхожденияБылоОтправлено = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втФинал.ЛистУчета,
	|	втФинал.ТорговаяТочка,
	|	втФинал.НачальныйОстаток,
	|	втФинал.НаличныеПоступления,
	|	втФинал.ВозвратыДС,
	|	втФинал.РазницаПоДеньгам,
	|	втФинал.Инкассация,
	|	втФинал.КонечныйОстаток,
	|	втФинал.ПисьмоРасхожденияБылоОтправлено,
	|	втФинал.ОтправленоПисьмоОтмены,
	|	втФинал.ПисьмоОтменыБылоОтправлено,
	|	втФинал.ОтветственныйЗаОтмену,
	|	втФинал.ПричинаОтмены,
	|	втФинал.ЭтоДеньИнкассации,
	|	втФинал.Контроль,
	|	втФинал.Инкассатор,
	|	втФинал.Период,
	|	втФинал.НомерЯвочнойКартыДляИнкассации,
	|	втФинал.Самоинкассация,
	|	втФинал.Окраска,
	|	втФинал.АдресРасчётчикаВЛистеУчёта
	|ИЗ
	|	втФинал КАК втФинал
	|ГДЕ
	|	втФинал.Контроль = ""Превышен лимит инкассации!""";		
	
	Запрос.УстановитьПараметр("ДатаНачала", ?(НачПериода = Неопределено, НачалоДня(ТекущаяДата()) - 86400, НачПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(ТекущаяДата()));	
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	СтруктураПисьма = Новый Структура;
	Кому = Новый СписокЗначений;
	Кому.Добавить("lagp@automacon.ru");
	СтруктураПисьма.Вставить("Кому", Кому);
				
	СтруктураПисьма.Вставить("Тема", "Обработка КонтрольИнкассаций (после запроса) - " + ТекущаяДата());
	СтруктураПисьма.Вставить("Тело", "123");
	СтруктураПисьма.Вставить("СписокФайловВложений", Новый Массив);
				
	ОбщегоНазначенияКлиентСервер.ОтправитьПисьмоПоПочте(СтруктураПисьма);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		ТаблицаДанных = РезультатЗапроса.Выгрузить();
		ТаблицаДанных.Колонки.Добавить("АдресаДляРассылкиБухРасчётчик");
		ТаблицаДанных.Колонки.Добавить("АдресаДляРассылкиПомощникТУЗ");
		ТаблицаДанных.Колонки.Добавить("ОбщаяСтрокаАдресатов", Новый ОписаниеТипов("Строка"));
		ТаблицАдресовОтветственных = ПолучитьТаблицуАдресов(ТаблицаДанных.ВыгрузитьКолонку("ТорговаяТочка"));
		АдресаЕсть = ЗначениеЗаполнено(ТаблицАдресовОтветственных);
		
		Для каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
			
			Если АдресаЕсть Тогда
				НайденнаяСтрокаАдресов = ТаблицАдресовОтветственных.Найти(СтрокаТаблицыДанных.ТорговаяТочка);
				Если ЗначениеЗаполнено(НайденнаяСтрокаАдресов) Тогда
					СтрокаТаблицыДанных.ОбщаяСтрокаАдресатов			= "" + НайденнаяСтрокаАдресов.АдресаДляРассылкиБухРасчётчик + НайденнаяСтрокаАдресов.АдресаДляРассылкиПомощникТУЗ + СтрокаТаблицыДанных.АдресРасчётчикаВЛистеУчёта;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;			
	
	ТДОбщая = ТаблицаДанных.Скопировать();
	ТДОбщая.Свернуть("ОбщаяСтрокаАдресатов");
	ТаблицаАдресов = Новый ТаблицаЗначений;
	ТаблицаАдресов.Колонки.Добавить("Адрес");
	Для каждого СтрокаАдреса Из ТДОбщая Цикл
		МассивСтрок = Справочники.Контрагенты.РазложитьСтрокуВМассивПодстрок(СтрокаАдреса.ОбщаяСтрокаАдресатов,";");
		Для каждого СтрокаМассиваСтрок Из МассивСтрок Цикл
			Если ЗначениеЗаполнено(СтрокаМассиваСтрок) Тогда
				СтрокаТаблицыАдресов = ТаблицаАдресов.Добавить();
				СтрокаТаблицыАдресов.Адрес = СтрокаМассиваСтрок;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	ТаблицаАдресов.Свернуть("Адрес");
	
	СтруктураПисьма = Новый Структура;
	Кому = Новый СписокЗначений;
	Кому.Добавить("lagp@automacon.ru");
	СтруктураПисьма.Вставить("Кому", Кому);
				
	СтруктураПисьма.Вставить("Тема", "Обработка КонтрольИнкассаций (перед таб док) - " + ТекущаяДата());
	СтруктураПисьма.Вставить("Тело", "123");
	СтруктураПисьма.Вставить("СписокФайловВложений", Новый Массив);
				
	ОбщегоНазначенияКлиентСервер.ОтправитьПисьмоПоПочте(СтруктураПисьма);
	
	ОписаниеОшибки = "";
	Если ТаблицаДанных.Количество() > 0 Тогда
		ТабДок = СформироватьТабДок(ТаблицаДанных);
		Получатель = "buh18@vkusvill.ru;buh39@vkusvill.ru;buh53@vkusvill.ru;buh52@vkusvill.ru;buh56@vkusvill.ru;buh43@vkusvill.ru;buh02@p01.vkusvill.ru";
		Попытка
			ОтправитьПисьмо(ТабДок, Получатель);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;	
	КонецЕсли;	
	
	Для каждого ПолучательАдрес из ТаблицаАдресов Цикл
		ТабДок = СформироватьТабДок(ТаблицаДанных, ПолучательАдрес.Адрес);		
		Попытка
			ОтправитьПисьмо(ТабДок, ПолучательАдрес.Адрес);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		СтруктураПисьма = Новый Структура;
		Кому = Новый СписокЗначений;
		Кому.Добавить("lagp@automacon.ru");
		СтруктураПисьма.Вставить("Кому", Кому);
				
		СтруктураПисьма.Вставить("Тема", "Обработка КонтрольИнкассаций (ошибка отправки писем) - " + ТекущаяДата());
		СтруктураПисьма.Вставить("Тело", "" + ОписаниеОшибки);
		СтруктураПисьма.Вставить("СписокФайловВложений", Новый Массив);
				
		ОбщегоНазначенияКлиентСервер.ОтправитьПисьмоПоПочте(СтруктураПисьма);
	КонецЕсли;	
	
КонецПроцедуры

//+++АК LAGP 2018.11.20 ИП-00020402
Функция СформироватьТабДок(ТаблицаДанных, ПолучательАдрес = Неопределено)
	
	ТаблицаДанныхДляПисьма = ТаблицаДанных.Скопировать();
	
	Если ЗначениеЗаполнено(ПолучательАдрес) Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗДанные.Период,
		|	ТЗДанные.ТорговаяТочка,
		|	ТЗДанные.КонечныйОстаток,
		|	ТЗДанные.ЛистУчета,
		|	ВЫРАЗИТЬ(ТЗДанные.ОбщаяСтрокаАдресатов КАК СТРОКА(200)) КАК ОбщаяСтрокаАдресатов
		|ПОМЕСТИТЬ втДанные
		|ИЗ
		|	&ТЗДанные КАК ТЗДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанные.Период,
		|	втДанные.ТорговаяТочка,
		|	втДанные.КонечныйОстаток,
		|	втДанные.ЛистУчета,
		|	втДанные.ОбщаяСтрокаАдресатов
		|ИЗ
		|	втДанные КАК втДанные
		|ГДЕ
		|	втДанные.ОбщаяСтрокаАдресатов ПОДОБНО ""%"" + &ПолучательАдрес + ""%""";
		
		Запрос.УстановитьПараметр("ТЗДанные", ТаблицаДанныхДляПисьма);
		Запрос.УстановитьПараметр("ПолучательАдрес", СокрЛП(ПолучательАдрес));	
		
		ТаблицаДанныхДляПисьма = Запрос.Выполнить().Выгрузить();	
	КонецЕсли;	
	
	ТаблицаДанныхДляПисьма.Сортировать("ТорговаяТочка Возр");
	Макет = Обработки.КонтрольИнкассаций.ПолучитьМакет("ПревышениеЛимита");
	ТабДок = Новый ТабличныйДокумент();
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Строка");
	НомерПП = 1;
	Для каждого ОтобраннаяСтрока из ТаблицаДанныхДляПисьма Цикл
		Область.Параметры.НомерПП = НомерПП;
		Область.Параметры.Дата = ОтобраннаяСтрока.Период;
		Область.Параметры.Магазин = ОтобраннаяСтрока.ТорговаяТочка;
		Область.Параметры.Остаток = ОтобраннаяСтрока.КонечныйОстаток;
		Область.Параметры.ОтветственноеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтобраннаяСтрока.ЛистУчета, "Расчетчик");
		Область.Параметры.ЛистУчёта = ОтобраннаяСтрока.ЛистУчета;
		ТабДок.Вывести(Область);
		НомерПП = НомерПП + 1;
		МенеджерЗаписиКонтрольИнкассаций = РегистрыСведений.КонтрольИнкассаций.СоздатьМенеджерЗаписи();				
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиКонтрольИнкассаций, ОтобраннаяСтрока);
		МенеджерЗаписиКонтрольИнкассаций.ОтправленоПисьмоОРасхождении = ИСТИНА;
		МенеджерЗаписиКонтрольИнкассаций.Записать();	
	КонецЦикла;	
	
	Возврат ТабДок;	
	
КонецФункции	

//+++АК LAGP 2018.11.20 ИП-00020402
Функция ПолучитьТаблицуАдресов(МассивСтруктурныхЕдиниц)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеОбъектРольСрезПоследних.РольПользователя,
	|	СоответствиеОбъектРольСрезПоследних.Объект,
	|	РолиПользователейСоставРоли.Сотрудник,
	|	РолиПользователейСоставРоли.Ссылка,
	|	СоответствиеОбъектРольСрезПоследних.ТипРолиID
	|ПОМЕСТИТЬ втСотрудникиПолучатели
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(
	|			,
	|			Объект В (&МассивСтруктурныхЕдиниц)
	|					И ТипРолиID = ""BuhRaschetchik""
	|				ИЛИ ПОДСТРОКА(РольПользователя.Наименование, 0, 12) = ""Помощник_ТУ3"") КАК СоответствиеОбъектРольСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
	|		ПО СоответствиеОбъектРольСрезПоследних.РольПользователя = РолиПользователейСоставРоли.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиПолучатели.Объект КАК ТорговаяТочка,
	|	втСотрудникиПолучатели.Сотрудник,
	|	втСотрудникиПолучатели.ТипРолиID,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	втСотрудникиПолучатели КАК втСотрудникиПолучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО втСотрудникиПолучатели.Сотрудник = КонтактнаяИнформация.Объект
	|ГДЕ
	|	КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизЛица)";
	
	Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	ТаблицаВспомогательная = РезультатЗапроса.Выгрузить();
	ТаблицаВспомогательная.Свернуть("ТорговаяТочка");	
	ТаблицаВспомогательная.Колонки.Добавить("АдресаДляРассылкиБухРасчётчик");
	ТаблицаВспомогательная.Колонки.Добавить("АдресаДляРассылкиПомощникТУЗ");
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НайденныеСтроки = ТаблицаВспомогательная.НайтиСтроки(Новый Структура("ТорговаяТочка", ВыборкаДетальныеЗаписи.ТорговаяТочка));	
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			Если ВыборкаДетальныеЗаписи.ТипРолиID = "BuhRaschetchik" Тогда
				НайденнаяСтрока.АдресаДляРассылкиБухРасчётчик = "" + НайденнаяСтрока.АдресаДляРассылкиБухРасчётчик + ВыборкаДетальныеЗаписи.Представление + ";";	
			ИначеЕсли ВыборкаДетальныеЗаписи.ТипРолиID = "PomoshnikTerrUpravlyushego" Тогда
				НайденнаяСтрока.АдресаДляРассылкиПомощникТУЗ = "" + НайденнаяСтрока.АдресаДляРассылкиПомощникТУЗ + ВыборкаДетальныеЗаписи.Представление + ";";
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаВспомогательная; 
	
КонецФункции

//+++АК LAGP 2018.11.20 ИП-00020402
Процедура ОтправитьПисьмо(ТабДок, ПолучательАдрес)
	
	УчетнаяЗапись = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
	Почта = Новый ИнтернетПочта;
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Почта.Подключиться(Профиль);
	Письмо.Тема = "Зафиксировано превышение лимита остатка денежных средств (" + ПолучательАдрес + ")";
	
	Если ПолучательАдрес = "buh18@vkusvill.ru;buh39@vkusvill.ru;buh53@vkusvill.ru;buh52@vkusvill.ru;buh56@vkusvill.ru;buh43@vkusvill.ru;buh02@p01.vkusvill.ru" Тогда
		Письмо.Тема = "Зафиксировано превышение лимита остатка денежных средств (по всем точкам)";	
	КонецЕсли;	
		
	Письмо.ИмяОтправителя = ""+УчетнаяЗапись+"";
	Письмо.ИмяОтправителя  = ""+СокрЛП(УчетнаяЗапись)+"";
	Письмо.Отправитель     = ""+СокрЛП(УчетнаяЗапись)+"";
	
	МассивАдресов=Справочники.Контрагенты.РазложитьСтрокуВМассивПодстрок(ПолучательАдрес,";");
	МассивАдресов.Добавить("lagp@automacon.ru");
	Для каждого СтрокаАдрес из МассивАдресов Цикл	
		Получатель = Письмо.Получатели.Добавить();
		Получатель.Адрес = СтрокаАдрес;
	КонецЦикла;	
	
	Темп = "\\10.0.0.51\1c$\Заявки на роуминг\";
	ИмяФайлаТемп = Темп + "КонтрольИнкассацийТемп.htm";
	
	//ВремФайл = ПолучитьИмяВременногоФайла("htm");
	
	ТабДок.Записать(ИмяФайлаТемп, ТипФайлаТабличногоДокумента.HTML);
	//ТабДок.Записать(ВремФайл, ТипФайлаТабличногоДокумента.HTML);
	
	ТекстДокумент = Новый ТекстовыйДокумент();
	ТекстДокумент.Прочитать(ИмяФайлаТемп);
	
	Текст = ТекстДокумент.ПолучитьТекст();                          	
	НачалоБлокаСтиль = Найти(Текст, "<STYLE");
	КонецБлокаСтиль = Найти(Текст, "</STYLE");
	ТекстСтиль = Сред(Текст, НачалоБлокаСтиль, КонецБлокаСтиль - НачалоБлокаСтиль + 8);
	НачалоБлокаТело = Найти(Текст, "<BODY");
	КонецБлокаТело = Найти(Текст, "</BODY");
	ТекстТело = Сред(Текст, НачалоБлокаТело, КонецБлокаТело - НачалоБлокаТело + 7);
	
	ТекстПолный = "<HTML>" + Символы.ПС + ТекстСтиль + Символы.ПС + ТекстТело + Символы.ПС + "</HTML>";
	ТекстПолный = СтрЗаменить(ТекстПолный, "CELLSPACING=0", "CELLSPACING=0; border = 5");
	
	ТекстСообщения = Письмо.Тексты.Добавить();
	ТекстСообщения.Текст     = ТекстПолный;
	ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	
	ТекстДокумент = Неопределено;
	УдалитьФайлы(ИмяФайлаТемп);
	Почта.Послать(Письмо);
	Почта.Отключиться();
	
КонецПроцедуры
